# 1. > 
print(5 > 3)   # True, რადგან 5 უფრო დიდია 3-თან შედარებით
print(5 > 5)   # False, რადგან 5 არ არის მეტით 5-ზე
print(3 > 5)   # False, რადგან 3 ნაკლებია 5-თან შედარებით
print(10 > 5)  # True, რადგან 10 მეტია 5-ზე
print(5 > 7)   # False, რადგან 5 ნაკლებია 7-თან შედარებით

# 2. >= 
print(5 >= 3)  # True, რადგან 5 მეტია 3-ზე
print(5 >= 5)  # True, რადგან 5 არის ტოლი 5-ზე
print(3 >= 5)  # False, რადგან 3 ნაკლებია 5-თან შედარებით
print(10 >= 5) # True, რადგან 10 მეტია 5-ზე
print(5 >= 7)  # False, რადგან 5 ნაკლებია 7-თან შედარებით

# 3. < 
print(5 < 3)   # False, რადგან 5 არ არის ნაკლები 3-ზე
print(5 < 5)   # False, რადგან 5 არ არის ნაკლები 5-ზე
print(3 < 5)   # True, რადგან 3 ნაკლებია 5-თან შედარებით
print(10 < 5)  # False, რადგან 10 არ არის ნაკლები 5-ზე
print(5 < 7)   # True, რადგან 5 ნაკლებია 7-თან შედარებით

# 4. <= 
print(5 <= 3)  # False, რადგან 5 არ არის ნაკლები ან ტოლი 3-თან
print(5 <= 5)  # True, რადგან 5 არის ტოლი 5-ზე
print(3 <= 5)  # True, რადგან 3 ნაკლებია 5-თან შედარებით
print(10 <= 5) # False, რადგან 10 არ არის ნაკლები ან ტოლი 5-თან
print(5 <= 7)  # True, რადგან 5 ნაკლებია 7-თან შედარებით

# 5. == 
print(5 == 5)  # True, რადგან 5 არის ტოლი 5-ს
print(5 == 3)  # False, რადგან 5 არ არის ტოლი 3-ს
print(3 == 3)  # True, რადგან 3 არის ტოლი 3-ს
print(10 == 5) # False, რადგან 10 არ არის ტოლი 5-ს
print(5 == 7)  # False, რადგან 5 არ არის ტოლი 7-ს

# 6. != 
print(5 != 5)  # False, რადგან 5 არის ტოლი 5-ს
print(5 != 3)  # True, რადგან 5 არ არის ტოლი 3-ს
print(3 != 3)  # False, რადგან 3 არის ტოლი 3-ს
print(10 != 5) # True, რადგან 10 არ არის ტოლი 5-ს
print(5 != 7)  # True, რადგან 5 არ არის ტოლი 7-ს
