export const text = () => {
    /* 
    State არის კომპონენტის შიდა მონაცემი, რომელიც:
        --ინახავს ცვლად ინფორმაციას
        --დროთა განმავლობაში შეიძლება შეიცვალოს
        --მისი ცვლილება იწვევს UI-ის განახლებას
-----------------------------------------------------------------------------------------
    Hook არის სპეციალური ფუნქცია React-ში, რომელიც:
        --საშუალებას აძლევს ფუნქციურ კომპონენტებს გამოიყენონ React-ის შესაძლებლობები
        --აძლევს წვდომას state-ზე, lifecycle-ზე და სხვა მექანიზმებზე
        --ყოველთვის იწყება use სიტყვით
-----------------------------------------------------------------------------------------
    Built-in hook არის hook, რომელიც:
        --უკვე ჩაშენებულია React-ში
        --არ გვიწევს მისი თვითონ დაწერა
        --გამოიყენება state-ის, side effect-ების და კონტექსტის სამართავად
    */
}