// ეს გამოიტანს 1-დან 30-მდე
for (let i = 1; i <= 30; i++) {
    console.log(i);
}

// მმერე ეს გამოიტანს კენტ რიცხვებს ხუტიდან ორმოცამდე
for (let i = 5; i <= 40; i++) {
    if (i % 2 !== 0) {
        console.log(i);
    }
}

// ეს გამოიტანს რიცხვებს ოცის ქვემოტ
for (let i = 20; i >= 0; i--) {
    console.log(i);
}



// for...of ციკლი: გამოიყენება iterable ობიექტებზე მაგ მასივები, სტრინგები და კიდევ მეტი ის აბრუნებს თითოეულ ელემენტს 

// for...in ციკლი: გამოიყენება ობიექტებზე და მასივებზე.ის აბრუნებს **გასაღებებს (key)** — ობიექტის თვისებების ან მასივის ინდექსების სახით.


