# split() — სტრინგის გაყოფა სიაში
text = "გამარჯობა როგორ ხარ"
words = text.split()
print(words)
# ////////////////////////////////////////
# join() — ელემენტების შეკრება სტრინგად
words = ['გამარჯობა', 'როგორ', 'ხარ']
sentence = ' '.join(words)
print(sentence)
# ///////////////////////////////////////
# replace() — ტექსტის ჩანაცვლება
text = "გამარჯობა, როგორ ხარ?"
new_text = text.replace("როგორ", "მშვენიერად")
print(new_text)
# //////////////////////////////////////
# strip() — ზედმეტი სივრცეების მოცილება სტრინგის დასაწყისში და ბოლოს
text = "   გამარჯობა   "
clean_text = text.strip()
print(f"'{clean_text}'")
# ///////////////////////////////////////