# for ციკლის საშვალებით გამოიტანეთ რიცხვები 20-მდე
for num in range(1,21):
    print(num)

# for ციკლის საშვალებით გამოიტანეთ რიცხვები 30-ის ჩათვლით
for num1 in range(1,31):
    print(num1)

# for ციკლის საშვალებით გამოიტანეთ რიცხვები 15-იდან 80-მდე
for num2 in range(15,81):
    print(num2)

# for ციკლის საშვალებით გამოიტანეთ რიცხვები 0-იდან 64-ის ჩათვლით
for num3 in range(0,65):
    print(num3)

# for ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ჩათვლით
for num4 in range(0, 50, 3):
    print(num4)

# პროგრამას ჩადურად დაათვლევინეთ 50-ის ჩათვლით
for num5 in range(51):
    print(num5)

# პროგრამას გამოტანინეთ ყველა ლუწი რიცხვი 100-მდე
for num6 in range(0, 100, 2):
    print(num6)
