# 8) შემოიტანეთ წინადადება input-ით და გამოიყენეთ capitalize ისე, რომ მხოლოდ პირველი ასო დარჩეს დიდი
word = input("enter your word: ")
print(word.capitalize())
#########################################################################################################################
# 9) მოცემული სტრინგია "gEoRGia". გადააკეთეთ ისე, რომ მხოლოდ პირველი ასო იყოს დიდი, დანარჩენი კი პატარა
word = "gEoRGia"
print(word.capitalize())
#########################################################################################################################
# 10) მოცემული სიაა: ["georgia", "aRMENIA", "greeCE"]. ყველა ელემენტს ჯერ გაუკეთეთ lower, შემდეგ capitalize და დაბეჭდეთ
list = ["georgia", "aRMENIA", "greeCE"]
for worrd in list:
    print(worrd.lower())
    print(worrd.capitalize())