// პრიმიტიული მნიშვნელობები არის მონაცემთა ყველაზე მარტივი ტიპები რომლებსაც აქვთ განსაზღვრული ზომა და ინახება stack მეხსიერებაში. 
// ნუ მაგალითად ეს
let age = 25;
let name = "luka";
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// stack & heaaap--> ინახავს პრიმიტიულ ტიპებს ან reference-ებს კომპლექსურ ობიექტებზე.
// ეს სტაკში ინახება ხოლო ზემოტ რაც მიწეწრია ეგ heap-ში
function sayHello() {
  let greeting = "Hi"; 
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Memory leak--> როდესაც პროგრამა არ ათავისუფლებს იმ მეხსიერებას რომელსაც აღარ იყენებს
let data = [];

function leakMemory() {
  let bigArray = new Array(1000000).fill("💾");
  data.push(bigArray); 
}
