# შექმენით 5 ცვლადი რომლებშიც შეინახავთ წიგნების თავდაპირველ ფასს, შემდეგ შექმენით ცვლადი რომელშიც შეინახავთ ფასდაკლების ოდენობას, შექმენით ახალი ფასის მქონე წიგნების ცვლადები, რომელთა მნიშვნელობა იქნება ძველ მნიშვნელობას გამოკლებული ახალი, საბოლოოდ კი დაბეჭდეთ ახალი წიგნების ფასები (გამოიყენეთ კარგი მიდგომები: რომ ცვლადის მნიშვნელობის მინიჭებისას შეგიძლიათ სხვა ცვლადის გამოყენება, კოდი ახსენით კომენტარების საშვალებით, ცვლადებს დაარქვით აღმწერი სახელები snake_case-ის სტილში)

#პირველ რიგსჰი ჩვენ ვქმნით 5 ცვლადს რომელსაც დავარქმევთ snake_case
snake_case = 50
snake_case1 = 60
snake_case2 = 80
snake_case3 = 100
snake_case4 = 120
snake_case5 = 140
#შემდეგ ვქმნით ფასდაკლების ცვლადს
low_price = 20
low_price1 = 40
#ხოლო შემდეგ უკვე ვაკლებთ ფასს
print( snake_case - low_price )
print( snake_case1 - low_price )
print( snake_case2 - low_price )
print( snake_case3 - low_price1 )
print( snake_case4 - low_price1 )
print( snake_case5 - low_price1 )
