function sayHello() {
  console.log("გამარჯობა! ეს არის ფუნქციის გამოძახება.");
}
/* 
setInterval
გამოიყენება იმისათვის, რომ მოცემული ფუნქცია გაეშვას განმეორებით ყოველ მითითებულ ინტერვალში.
*/
///////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
setTimeout
გამოიყენება იმისათვის, რომ მოცემული ფუნქცია გაეშვას მხოლოდ ერთხელ,მითითებული დროის გასვლის შემდეგ. 
setTimeout(sayHello, 4000) ნიშნავს, რომ sayHello() ფუნქცია გაეშვება ერთხელ 4 წამში.
*/
setTimeout(sayHello, 4000);
